; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p15---int100n150-m25---int100c150---s457---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level21 level21)
(sum level1 level2 level3)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level21 level22)
(sum level2 level2 level4)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level21 level23)
(sum level3 level2 level5)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level21 level24)
(sum level4 level2 level6)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level21 level25)
(sum level5 level2 level7)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level21 level26)
(sum level6 level2 level8)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level21 level27)
(sum level7 level2 level9)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level21 level28)
(sum level8 level2 level10)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level21 level29)
(sum level9 level2 level11)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level21 level30)
(sum level10 level2 level12)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level21 level31)
(sum level11 level2 level13)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level21 level32)
(sum level12 level2 level14)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level21 level33)
(sum level13 level2 level15)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level21 level34)
(sum level14 level2 level16)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level21 level35)
(sum level15 level2 level17)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level21 level36)
(sum level16 level2 level18)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level21 level37)
(sum level17 level2 level19)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level21 level38)
(sum level18 level2 level20)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level21 level39)
(sum level19 level2 level21)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level21 level40)
(sum level20 level2 level22)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level21 level41)
(sum level21 level2 level23)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level21 level42)
(sum level22 level2 level24)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level21 level43)
(sum level23 level2 level25)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level21 level44)
(sum level24 level2 level26)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level21 level45)
(sum level25 level2 level27)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level21 level46)
(sum level26 level2 level28)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level21 level47)
(sum level27 level2 level29)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level21 level48)
(sum level28 level2 level30)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level21 level49)
(sum level29 level2 level31)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level30 level2 level32)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level31 level2 level33)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level32 level2 level34)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level33 level2 level35)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level34 level2 level36)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level35 level2 level37)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level36 level2 level38)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level37 level2 level39)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level38 level2 level40)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level39 level2 level41)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level40 level2 level42)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level9 level49)
(sum level41 level2 level43)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level42 level2 level44)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level43 level2 level45)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level44 level2 level46)
(sum level44 level5 level49)
(sum level45 level2 level47)
(sum level46 level2 level48)
(sum level47 level2 level49)

(connected l0 l2)
(fuelcost level2 l0 l2)
(connected l0 l3)
(fuelcost level6 l0 l3)
(connected l0 l4)
(fuelcost level7 l0 l4)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level5 l1 l3)
(connected l1 l4)
(fuelcost level21 l1 l4)
(connected l2 l0)
(fuelcost level2 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l3 l0)
(fuelcost level6 l3 l0)
(connected l3 l1)
(fuelcost level5 l3 l1)
(connected l3 l4)
(fuelcost level9 l3 l4)
(connected l4 l0)
(fuelcost level7 l4 l0)
(connected l4 l1)
(fuelcost level21 l4 l1)
(connected l4 l3)
(fuelcost level9 l4 l3)

(at t0 l2)
(fuel t0 level49)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l1)
(at p6 l2)
(at p7 l2)
(at p8 l4)
(at p9 l2)
(at p10 l4)
(at p11 l2)
(at p12 l1)
(at p13 l0)
(at p14 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l4)
(at p2 l0)
(at p3 l3)
(at p4 l2)
(at p5 l2)
(at p6 l4)
(at p7 l3)
(at p8 l0)
(at p9 l1)
(at p10 l2)
(at p11 l3)
(at p12 l4)
(at p13 l3)
(at p14 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 15
2. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 15
3. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 15
4. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 15
5. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 0 of 15
6. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 15
7. (drive t0 l2 l1 level43 level6 level49)
   deleted: (at t0 l2) (fuel t0 level49)
   added: (at t0 l1) (fuel t0 level43)
   goals met: 0 of 15
8. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 15
9. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 0 of 15
10. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 15
11. (drive t0 l1 l4 level22 level21 level43)
   deleted: (at t0 l1) (fuel t0 level43)
   added: (at t0 l4) (fuel t0 level22)
   goals met: 0 of 15
12. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 1 of 15
13. (unload p12 t0 l4)
   deleted: (in p12 t0)
   added: (at p12 l4)
   goals met: 2 of 15
14. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 3 of 15
15. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 3 of 15
16. (load p10 t0 l4)
   deleted: (at p10 l4)
   added: (in p10 t0)
   goals met: 3 of 15
17. (drive t0 l4 l0 level15 level7 level22)
   deleted: (at t0 l4) (fuel t0 level22)
   added: (at t0 l0) (fuel t0 level15)
   goals met: 3 of 15
18. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 4 of 15
19. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 5 of 15
20. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 5 of 15
21. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 5 of 15
22. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 5 of 15
23. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 5 of 15
24. (drive t0 l0 l2 level13 level2 level15)
   deleted: (at t0 l0) (fuel t0 level15)
   added: (at t0 l2) (fuel t0 level13)
   goals met: 5 of 15
25. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 6 of 15
26. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 7 of 15
27. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 8 of 15
28. (drive t0 l2 l1 level7 level6 level13)
   deleted: (at t0 l2) (fuel t0 level13)
   added: (at t0 l1) (fuel t0 level7)
   goals met: 8 of 15
29. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 9 of 15
30. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 10 of 15
31. (drive t0 l1 l3 level2 level5 level7)
   deleted: (at t0 l1) (fuel t0 level7)
   added: (at t0 l3) (fuel t0 level2)
   goals met: 10 of 15
32. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 11 of 15
33. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 12 of 15
34. (unload p14 t0 l3)
   deleted: (in p14 t0)
   added: (at p14 l3)
   goals met: 13 of 15
35. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 14 of 15
36. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 15 of 15
